Repository: devopscodepro/macaffeine
Catalog: Macaffeine/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, ko, ru, th, zh_hans

# %@ remaining · until %@
source: %1$@ remaining · until %2$@
ar: متبقٍ %1$@ · حتى %2$@
de: noch %1$@ · bis %2$@
ko: %1$@ 남음 · %2$@까지
ru: Осталось %1$@ · до %2$@
th: เหลือ %1$@ · ถึง %2$@
zh_hans: 剩余 %1$@ · 至 %2$@

source: %lld h
ar: %lld س
de: %lld Std.
ko: %lld시간
ru: %lld ч
th: %lld ชม.
zh_hans: %lld 小时

source: %lld min
ar: %lld د
ko: %lld분
ru: %lld мин
th: %lld นาที
zh_hans: %lld 分钟

source: %lldh
ar: %lld س
de: %lld Std.
ko: %lld시간
ru: %lld ч
th: %lld ชม.
zh_hans: %lld小时

# %lldh %lldm
source: %1$lldh %2$lldm
ar: %1$lld س %2$lld د
de: %1$lld Std. %2$lld Min.
ko: %1$lld시간 %2$lld분
ru: %1$lld ч %2$lld мин
th: %1$lld ชม. %2$lld นาที
zh_hans: %1$lld小时%2$lld分

source: %lldm
ar: %lld د
de: %lld Min.
ko: %lld분
ru: %lld мин
th: %lld นาที
zh_hans: %lld分钟

source: About Macaffeine
ar: حول Macaffeine
de: Über Macaffeine
ko: Macaffeine에 관하여
ru: О программе Macaffeine
th: เกี่ยวกับ Macaffeine
zh_hans: 关于 Macaffeine

source: Active for Duration
ar: المدة
de: Dauer
ko: 유지 시간
ru: Длительность
th: ระยะเวลา
zh_hans: 持续时间

source: Add
ar: إضافة
de: Hinzufügen
ko: 추가
ru: Добавить
th: เพิ่ม
zh_hans: 添加

source: Allow Mac to Sleep
ar: السماح لـ Mac بالسكون
de: Ruhezustand erlauben
ko: Mac 잠자기 허용
ru: Разрешить Mac засыпать
th: อนุญาตให้ Mac พัก
zh_hans: 允许 Mac 睡眠

source: Allow Macaffeine in System Settings → General → Login Items.
ar: اسمح لـ Macaffeine في إعدادات النظام ← عام ← عناصر تسجيل الدخول.
de: Erlaube Macaffeine in Systemeinstellungen → Allgemein → Anmeldeobjekte.
ko: 시스템 설정 → 일반 → 로그인 항목에서 Macaffeine을 허용하세요.
ru: Разрешите Macaffeine в Системных настройках → Основные → Объекты входа.
th: อนุญาต Macaffeine ในการตั้งค่าระบบ → ทั่วไป → รายการเข้าสู่ระบบ
zh_hans: 请在“系统设置”→“通用”→“登录项”中允许 Macaffeine。

source: Also Keeping Your Mac Awake
ar: يمنع سكون Mac أيضًا
de: Halten den Mac ebenfalls wach
ko: Mac 잠자기를 막고 있는 다른 항목
ru: Также не дают Mac уснуть
th: รายการอื่นที่ไม่ให้ Mac พัก
zh_hans: 其他阻止 Mac 睡眠的项目

source: Also when it locks by itself after the display turns off.
ar: وكذلك عندما تُقفل الشاشة تلقائيًا بعد إيقاف الشاشة.
de: Auch wenn er sich nach dem Ausschalten des Displays von selbst sperrt.
ko: 디스플레이가 꺼진 뒤 화면이 자동으로 잠길 때도 포함됩니다.
ru: В том числе когда экран блокируется сам после отключения дисплея.
th: รวมถึงเมื่อหน้าจอล็อกเองหลังจากจอภาพปิด
zh_hans: 包括显示器关闭后屏幕自动锁定的情况。

source: Battery is below %lld%%, your Mac can sleep again.
ar: البطارية أقل من %lld%%، يمكن لـ Mac السكون مجددًا.
de: Der Akku liegt unter %lld %%, dein Mac darf wieder in den Ruhezustand.
ko: 배터리가 %lld%% 미만이라 Mac이 다시 잠자기할 수 있습니다.
ru: Заряд ниже %lld%%, Mac снова может засыпать.
th: แบตเตอรี่ต่ำกว่า %lld%% Mac จึงพักได้อีกครั้ง
zh_hans: 电池电量低于 %lld%%，Mac 可以重新进入睡眠。

source: Battery is below %lld%%. Plug in to keep awake.
ar: البطارية أقل من %lld%%. صِل الشاحن للمتابعة.
de: Der Akku liegt unter %lld %%. Schließe das Netzteil an, um weiterzumachen.
ko: 배터리가 %lld%% 미만입니다. 계속하려면 전원을 연결하세요.
ru: Заряд ниже %lld%%. Подключите питание, чтобы продолжить.
th: แบตเตอรี่ต่ำกว่า %lld%% เสียบสายชาร์จเพื่อใช้งานต่อ
zh_hans: 电池电量低于 %lld%%。请接通电源以继续。

source: Battery level
ar: مستوى البطارية
de: Akkustand
ko: 배터리 잔량
ru: Уровень заряда
th: ระดับแบตเตอรี่
zh_hans: 电池电量

source: Below %lld%%
ar: أقل من %lld%%
de: Unter %lld %%
ko: %lld%% 미만
ru: Ниже %lld%%
th: ต่ำกว่า %lld%%
zh_hans: 低于 %lld%%

source: Cancel
ar: إلغاء
de: Abbrechen
ko: 취소
ru: Отменить
th: ยกเลิก
zh_hans: 取消

source: Choose a duration or press %@
ar: اختر مدة أو اضغط %@
de: Wähle eine Dauer oder drücke %@
ko: 시간을 선택하거나 %@ 키를 누르세요
ru: Выберите длительность или нажмите %@
th: เลือกระยะเวลาหรือกด %@
zh_hans: 选择持续时间或按 %@

source: Choose a duration to keep it awake
ar: اختر مدة لإبقائه مستيقظًا
de: Wähle eine Dauer, um ihn wach zu halten
ko: 잠자기를 막을 시간을 선택하세요
ru: Выберите длительность, чтобы Mac не засыпал
th: เลือกระยะเวลาเพื่อไม่ให้ Mac พัก
zh_hans: 选择保持唤醒的时间

source: Click to record a new shortcut
ar: انقر لتسجيل اختصار جديد
de: Klicken, um einen neuen Kurzbefehl aufzunehmen
ko: 클릭하여 새 단축키 입력
ru: Нажмите, чтобы задать новое сочетание
th: คลิกเพื่อบันทึกคำสั่งลัดใหม่
zh_hans: 点按以录制新的快捷键

source: Close
ar: إغلاق
de: Schließen
ko: 닫기
ru: Закрыть
th: ปิด
zh_hans: 关闭

source: Closing the lid still puts your Mac to sleep unless it's connected to power and an external display. That's how macOS works, Macaffeine doesn't change it.
ar: إغلاق الغطاء يُدخل Mac في وضع السكون ما لم يكن متصلًا بالطاقة وبشاشة خارجية. هكذا يعمل macOS، ولا يغيّر Macaffeine ذلك.
de: Beim Zuklappen geht dein Mac trotzdem in den Ruhezustand, außer er ist mit Strom und einem externen Display verbunden. So funktioniert macOS, Macaffeine ändert daran nichts.
ko: 전원과 외장 디스플레이에 연결되어 있지 않으면 덮개를 닫을 때 Mac은 잠자기 상태가 됩니다. macOS의 동작 방식이며 Macaffeine은 이를 바꾸지 않습니다.
ru: Если закрыть крышку, Mac всё равно уснёт, если он не подключён к питанию и внешнему монитору. Так устроена macOS, и Macaffeine это не меняет.
th: การปิดฝายังคงทำให้ Mac พัก เว้นแต่เชื่อมต่อกับไฟและจอภาพภายนอก นี่คือการทำงานของ macOS และ Macaffeine ไม่เปลี่ยนแปลงสิ่งนี้
zh_hans: 除非连接了电源和外接显示器，合上屏幕后 Mac 仍会进入睡眠。这是 macOS 的工作方式，Macaffeine 不会改变它。

source: Command Line Tool
ar: أداة سطر الأوامر
de: Befehlszeilenwerkzeug
ko: 명령어 도구
ru: Командная строка
th: เครื่องมือบรรทัดคำสั่ง
zh_hans: 命令行工具

source: Commands kept awake with `macaffeine run` or `hold` keep running in both cases.
ar: الأوامر التي تعمل عبر `macaffeine run` أو `hold` تستمر في الحالتين.
de: Befehle, die mit `macaffeine run` oder `hold` wach gehalten werden, laufen in beiden Fällen weiter.
ko: `macaffeine run` 또는 `hold`로 유지 중인 명령은 두 경우 모두 계속 실행됩니다.
ru: Команды, запущенные через `macaffeine run` или `hold`, в обоих случаях продолжают работать.
th: คำสั่งที่ใช้ `macaffeine run` หรือ `hold` จะทำงานต่อในทั้งสองกรณี
zh_hans: 通过 `macaffeine run` 或 `hold` 保持唤醒的命令在这两种情况下都会继续运行。

source: Copied
ar: تم النسخ
de: Kopiert
ko: 복사됨
ru: Скопировано
th: คัดลอกแล้ว
zh_hans: 已拷贝

source: Copy
ar: نسخ
de: Kopieren
ko: 복사
ru: Скопировать
th: คัดลอก
zh_hans: 拷贝

source: Couldn't keep your Mac awake
ar: تعذّر إبقاء Mac مستيقظًا
de: Dein Mac konnte nicht wach gehalten werden
ko: Mac 잠자기를 막지 못했습니다
ru: Не удалось запретить сон
th: ไม่สามารถกัน Mac ไม่ให้พักได้
zh_hans: 无法保持 Mac 唤醒

source: Durations
ar: المدد
de: Zeiten
ko: 시간
ru: Длительности
th: ระยะเวลา
zh_hans: 时长

source: For %lld tasks
ar: لـ %lld مهام
de: Für %lld Aufgaben
ko: 작업 %lld개 실행 중
ru: Задач: %lld
th: งาน %lld รายการ
zh_hans: %lld 个任务运行中

source: General
ar: عام
de: Allgemein
ko: 일반
ru: Основные
th: ทั่วไป
zh_hans: 通用

source: Hide Macaffeine
ar: إخفاء Macaffeine
de: Macaffeine ausblenden
ko: Macaffeine 가리기
ru: Скрыть Macaffeine
th: ซ่อน Macaffeine
zh_hans: 隐藏 Macaffeine

source: Hours
ar: ساعات
de: Stunden
ko: 시간
ru: Часы
th: ชั่วโมง
zh_hans: 小时

source: If the time has already passed today, Macaffeine keeps your Mac awake until that time tomorrow.
ar: إذا كان هذا الوقت قد مضى اليوم، فسيُبقي Macaffeine جهاز Mac مستيقظًا حتى هذا الوقت غدًا.
de: Ist die Uhrzeit heute schon vorbei, hält Macaffeine deinen Mac bis morgen zu dieser Zeit wach.
ko: 오늘 이미 지난 시간이면 내일 그 시간까지 Mac이 잠자기하지 않습니다.
ru: Если это время сегодня уже прошло, Macaffeine не даст Mac уснуть до этого времени завтра.
th: หากเวลานี้ของวันนี้ผ่านไปแล้ว Macaffeine จะไม่ให้ Mac พักจนถึงเวลานี้ของวันพรุ่งนี้
zh_hans: 如果今天已过该时间，Macaffeine 会让 Mac 保持唤醒直到明天的这个时间。

source: Indefinite
ar: بلا حد
de: Unbegrenzt
ko: 무기한
ru: Без ограничения
th: ไม่จำกัดเวลา
zh_hans: 无限期

source: Indefinite is always available.
ar: خيار «بلا حد» متاح دائمًا.
de: „Unbegrenzt“ ist immer verfügbar.
ko: 무기한은 항상 사용할 수 있습니다.
ru: «Без ограничения» доступно всегда.
th: “ไม่จำกัดเวลา” มีให้เลือกเสมอ
zh_hans: “无限期”始终可用。

source: Is Mac Kept Awake
ar: هل Mac مستيقظ
de: Wird der Mac wach gehalten
ko: Mac 잠자기 방지 중인지 확인
ru: Mac сейчас не засыпает?
th: Mac ถูกกันไม่ให้พักอยู่หรือไม่
zh_hans: Mac 是否保持唤醒

source: Keep Awake
ar: إبقاء مستيقظًا
de: Wach halten
ko: 잠자기 방지
ru: Не засыпать
th: กันพัก
zh_hans: 保持唤醒

source: Keep Awake finished
ar: انتهى إبقاء Mac مستيقظًا
de: Wach halten beendet
ko: 잠자기 방지 종료
ru: Время вышло
th: กันพักสิ้นสุดแล้ว
zh_hans: 保持唤醒已结束

source: Keep Awake stopped
ar: توقف إبقاء Mac مستيقظًا
de: Wach halten gestoppt
ko: 잠자기 방지 중단됨
ru: «Не засыпать» выключено
th: กันพักหยุดแล้ว
zh_hans: 保持唤醒已停止

source: Keep awake until
ar: إبقاء مستيقظًا حتى
de: Wach halten bis
ko: 잠자기 방지 종료 시각
ru: Не засыпать до
th: กันพักถึงเวลา
zh_hans: 保持唤醒直到

source: Keep display on
ar: إبقاء الشاشة قيد التشغيل
de: Display eingeschaltet lassen
ko: 디스플레이 켜두기
ru: Не гасить экран
th: เปิดจอภาพค้างไว้
zh_hans: 保持显示器开启

source: Keep Display On
ar: إبقاء الشاشة قيد التشغيل
de: Display eingeschaltet lassen
ko: 디스플레이 켜두기
ru: Не гасить экран
th: เปิดจอภาพค้างไว้
zh_hans: 保持显示器开启

source: Keep Mac Awake
ar: إبقاء Mac مستيقظًا
de: Mac wach halten
ko: Mac 잠자기 방지
ru: Не давать Mac уснуть
th: กัน Mac ไม่ให้พัก
zh_hans: 保持 Mac 唤醒

source: Keep Mac awake for ${minutes} minutes
ar: إبقاء Mac مستيقظًا لمدة ${minutes} دقيقة
de: Mac ${minutes} Minuten wach halten
ko: ${minutes}분 동안 Mac 잠자기 방지
ru: Не давать Mac уснуть ${minutes} мин
th: กัน Mac ไม่ให้พัก ${minutes} นาที
zh_hans: 保持 Mac 唤醒 ${minutes} 分钟

source: Keep your Mac awake while a command runs, for example `macaffeine run -- make`. To install it, run this in Terminal:
ar: أبقِ Mac مستيقظًا أثناء تشغيل أمر، مثل `macaffeine run -- make`. للتثبيت، شغّل ما يلي في Terminal:
de: Hält deinen Mac wach, solange ein Befehl läuft, zum Beispiel `macaffeine run -- make`. Zum Installieren im Terminal ausführen:
ko: 명령이 실행되는 동안 Mac 잠자기를 막습니다. 예: `macaffeine run -- make`. 설치하려면 터미널에서 다음을 실행하세요:
ru: Mac не уснёт, пока выполняется команда, например `macaffeine run -- make`. Чтобы установить утилиту, выполните в Терминале:
th: กัน Mac ไม่ให้พักขณะที่คำสั่งทำงาน เช่น `macaffeine run -- make` หากต้องการติดตั้ง ให้เรียกใช้สิ่งนี้ในเทอร์มินัล:
zh_hans: 在命令运行期间保持 Mac 唤醒，例如 `macaffeine run -- make`。要安装它，请在“终端”中运行：

source: Keeping your Mac awake
ar: يُبقي Mac مستيقظًا
de: Dein Mac wird wach gehalten
ko: Mac 잠자기 방지 중
ru: Mac не уснёт
th: กัน Mac ไม่ให้พักอยู่
zh_hans: Mac 保持唤醒中

source: Keeps your Mac awake for a number of minutes, or until you turn it off.
ar: يُبقي Mac مستيقظًا لعدد من الدقائق أو حتى تُوقفه.
de: Hält deinen Mac für eine Anzahl Minuten wach oder bis du es ausschaltest.
ko: 지정한 시간(분) 동안 또는 끌 때까지 Mac 잠자기를 막습니다.
ru: Не даёт Mac уснуть заданное число минут или пока вы не выключите режим.
th: กัน Mac ไม่ให้พักตามจำนวนนาที หรือจนกว่าคุณจะปิด
zh_hans: 让 Mac 在指定分钟内保持唤醒，或直到你将其关闭。

source: Launch at Login
ar: الفتح عند تسجيل الدخول
de: Bei der Anmeldung öffnen
ko: 로그인 시 열기
ru: Открывать при входе
th: เปิดเมื่อเข้าสู่ระบบ
zh_hans: 登录时打开

source: Leave empty to keep your Mac awake until you turn it off.
ar: اتركه فارغًا لإبقاء Mac مستيقظًا حتى تُوقفه.
de: Leer lassen, um deinen Mac wach zu halten, bis du es ausschaltest.
ko: 비워 두면 끌 때까지 Mac 잠자기를 막습니다.
ru: Оставьте пустым, чтобы Mac не засыпал, пока вы не выключите режим.
th: เว้นว่างไว้เพื่อกัน Mac ไม่ให้พักจนกว่าคุณจะปิด
zh_hans: 留空则让 Mac 保持唤醒，直到你将其关闭。

source: Let it cool down and try again.
ar: اتركه يبرد ثم حاول مجددًا.
de: Lass ihn abkühlen und versuche es erneut.
ko: 열을 식힌 후 다시 시도하세요.
ru: Дайте ему остыть и попробуйте снова.
th: รอให้เย็นลงแล้วลองอีกครั้ง
zh_hans: 请等待降温后重试。

source: Low Power Mode is on, your Mac can sleep again.
ar: وضع الطاقة المنخفضة مفعّل، يمكن لـ Mac السكون مجددًا.
de: Der Stromsparmodus ist an, dein Mac darf wieder in den Ruhezustand.
ko: 저전력 모드가 켜져 있어 Mac이 다시 잠자기할 수 있습니다.
ru: Включено энергосбережение, Mac снова может засыпать.
th: โหมดพลังงานต่ำเปิดอยู่ Mac จึงพักได้อีกครั้ง
zh_hans: 低电量模式已开启，Mac 可以重新进入睡眠。

source: Low Power Mode means you want to save energy.
ar: وضع الطاقة المنخفضة يعني أنك تريد توفير الطاقة.
de: Der Stromsparmodus bedeutet, dass du Energie sparen willst.
ko: 저전력 모드는 에너지를 아끼고 싶다는 뜻이니까요.
ru: Раз включено энергосбережение, значит, вы бережёте заряд.
th: โหมดพลังงานต่ำหมายความว่าคุณต้องการประหยัดพลังงาน
zh_hans: 开启低电量模式说明你想节省电量。

source: Macaffeine is off
ar: Macaffeine متوقف
de: Macaffeine ist aus
ko: Macaffeine 꺼짐
ru: Macaffeine выключен
th: Macaffeine ปิดอยู่
zh_hans: Macaffeine 已关闭

source: Macaffeine isn't running yet. Try again in a moment.
ar: Macaffeine لا يعمل بعد. حاول مجددًا بعد لحظات.
de: Macaffeine läuft noch nicht. Versuche es gleich noch einmal.
ko: Macaffeine이 아직 실행되지 않았습니다. 잠시 후 다시 시도하세요.
ru: Macaffeine ещё не запущен. Попробуйте через пару секунд.
th: Macaffeine ยังไม่ได้ทำงาน ลองอีกครั้งในอีกสักครู่
zh_hans: Macaffeine 尚未运行，请稍后重试。

source: Macaffeine, keeping your Mac awake
ar: Macaffeine، يُبقي Mac مستيقظًا
de: Macaffeine, hält deinen Mac wach
ko: Macaffeine, Mac 잠자기 방지 중
ru: Macaffeine, Mac не уснёт
th: Macaffeine กัน Mac ไม่ให้พักอยู่
zh_hans: Macaffeine，Mac 保持唤醒中

source: Macaffeine, off
ar: Macaffeine، متوقف
de: Macaffeine, aus
ko: Macaffeine, 꺼짐
ru: Macaffeine, выключен
th: Macaffeine ปิดอยู่
zh_hans: Macaffeine，已关闭

source: macOS didn't accept this shortcut. Pick a different one.
ar: لم يقبل macOS هذا الاختصار. اختر اختصارًا آخر.
de: macOS hat diesen Kurzbefehl nicht akzeptiert. Wähle einen anderen.
ko: macOS에서 이 단축키를 사용할 수 없습니다. 다른 단축키를 선택하세요.
ru: macOS не приняла это сочетание. Выберите другое.
th: macOS ไม่ยอมรับคำสั่งลัดนี้ โปรดเลือกคำสั่งลัดอื่น
zh_hans: macOS 不接受此快捷键，请选择其他快捷键。

source: macOS refused the request. Try again.
ar: رفض macOS الطلب. حاول مجددًا.
de: macOS hat die Anfrage abgelehnt. Versuche es erneut.
ko: macOS가 요청을 거부했습니다. 다시 시도하세요.
ru: macOS отклонила запрос. Попробуйте снова.
th: macOS ปฏิเสธคำขอ ลองอีกครั้ง
zh_hans: macOS 拒绝了请求，请重试。

source: Made by Aleksei Popov
ar: من تطوير Aleksei Popov
de: Von Aleksei Popov
ko: 제작: Aleksei Popov
ru: Автор — Алексей Попов
th: สร้างโดย Aleksei Popov
zh_hans: 作者：Aleksei Popov

source: Minutes
ar: دقائق
de: Minuten
ko: 분
ru: Минуты
th: นาที
zh_hans: 分钟

source: Next to the cup, while a timer is running.
ar: بجانب الكوب أثناء عمل المؤقت.
de: Neben der Tasse, während ein Timer läuft.
ko: 타이머가 작동하는 동안 컵 옆에 표시됩니다.
ru: Рядом с чашкой, пока идёт таймер.
th: ข้างถ้วยกาแฟ ขณะที่ตัวจับเวลาทำงาน
zh_hans: 计时器运行时显示在咖啡杯旁边。

source: None
ar: لا شيء
de: Keiner
ko: 없음
ru: Нет
th: ไม่มี
zh_hans: 无

source: Notifications are turned off for Macaffeine.
ar: الإشعارات متوقفة لـ Macaffeine.
de: Mitteilungen für Macaffeine sind ausgeschaltet.
ko: Macaffeine 알림이 꺼져 있습니다.
ru: Уведомления для Macaffeine выключены.
th: การแจ้งเตือนของ Macaffeine ปิดอยู่
zh_hans: Macaffeine 的通知已关闭。

source: Notify when Keep Awake stops on its own
ar: الإشعار عندما يتوقف الإبقاء مستيقظًا تلقائيًا
de: Benachrichtigen, wenn Wach halten von selbst endet
ko: 잠자기 방지가 자동으로 꺼지면 알림
ru: Сообщать, когда режим выключается сам
th: แจ้งเตือนเมื่อกันพักหยุดเอง
zh_hans: 保持唤醒自动停止时发送通知

source: Only while running on battery.
ar: فقط عند العمل بالبطارية.
de: Nur im Akkubetrieb.
ko: 배터리 전원 사용 중에만 적용됩니다.
ru: Только при работе от аккумулятора.
th: เฉพาะเมื่อใช้แบตเตอรี่
zh_hans: 仅在使用电池供电时。

source: Open System Settings
ar: فتح إعدادات النظام
de: Systemeinstellungen öffnen
ko: 시스템 설정 열기
ru: Открыть Системные настройки
th: เปิดการตั้งค่าระบบ
zh_hans: 打开系统设置

source: Other apps are keeping your Mac awake
ar: تطبيقات أخرى تُبقي Mac مستيقظًا
de: Andere Apps halten deinen Mac wach
ko: 다른 앱이 Mac 잠자기를 막고 있습니다
ru: Mac не дают уснуть другие приложения
th: แอปอื่นกัน Mac ไม่ให้พักอยู่
zh_hans: 其他 App 正在阻止 Mac 睡眠

source: Press Esc to cancel, Delete to turn the shortcut off
ar: Esc للإلغاء، Delete لإيقاف الاختصار
de: Esc zum Abbrechen, Löschen zum Ausschalten des Kurzbefehls
ko: Esc: 취소, Delete: 단축키 끄기
ru: Esc — отмена, Delete — отключить сочетание
th: กด Esc เพื่อยกเลิก กด Delete เพื่อปิดคำสั่งลัด
zh_hans: 按 Esc 取消，按 Delete 关闭快捷键

source: Quit Macaffeine
ar: إنهاء Macaffeine
de: Macaffeine beenden
ko: Macaffeine 종료
ru: Завершить Macaffeine
th: ออกจาก Macaffeine
zh_hans: 退出 Macaffeine

source: Remove
ar: إزالة
de: Entfernen
ko: 제거
ru: Удалить
th: เอาออก
zh_hans: 移除

source: Remove %@
ar: إزالة %@
de: %@ entfernen
ko: %@ 제거
ru: Удалить %@
th: เอา %@ ออก
zh_hans: 移除%@

source: Requested by another app
ar: بطلب من تطبيق آخر
de: Von einer anderen App angefordert
ko: 다른 앱의 요청
ru: По запросу другого приложения
th: แอปอื่นร้องขอ
zh_hans: 由其他 App 请求

source: Reset shortcut
ar: إعادة تعيين الاختصار
de: Kurzbefehl zurücksetzen
ko: 단축키 재설정
ru: Сбросить сочетание
th: รีเซ็ตคำสั่งลัด
zh_hans: 重置快捷键

source: Reset to %@
ar: إعادة التعيين إلى %@
de: Auf %@ zurücksetzen
ko: %@(으)로 재설정
ru: Вернуть %@
th: รีเซ็ตเป็น %@
zh_hans: 重置为 %@

source: Restore Defaults
ar: استعادة الإعدادات الافتراضية
de: Standard wiederherstellen
ko: 기본값 복원
ru: Вернуть стандартные
th: คืนค่าเริ่มต้น
zh_hans: 恢复默认

source: Safety
ar: الأمان
de: Sicherheit
ko: 안전
ru: Защита
th: ความปลอดภัย
zh_hans: 安全

source: Settings…
ar: الإعدادات…
de: Einstellungen …
ko: 설정…
ru: Настройки…
th: การตั้งค่า…
zh_hans: 设置…

source: Show remaining time in the menu bar
ar: عرض الوقت المتبقي في شريط القائمة
de: Restzeit in der Menüleiste anzeigen
ko: 메뉴 막대에 남은 시간 표시
ru: Показывать оставшееся время в строке меню
th: แสดงเวลาที่เหลือในแถบเมนู
zh_hans: 在菜单栏中显示剩余时间

source: Stop after your Mac sleeps
ar: الإيقاف بعد سكون Mac
de: Nach dem Ruhezustand beenden
ko: Mac이 잠자기하면 중단
ru: Выключать после сна Mac
th: หยุดหลังจาก Mac พัก
zh_hans: Mac 睡眠后停止

source: Stop in Low Power Mode
ar: الإيقاف في وضع الطاقة المنخفضة
de: Im Stromsparmodus beenden
ko: 저전력 모드에서 중단
ru: Выключать в режиме энергосбережения
th: หยุดในโหมดพลังงานต่ำ
zh_hans: 低电量模式时停止

source: Stop when battery is low
ar: الإيقاف عند انخفاض البطارية
de: Bei niedrigem Akkustand beenden
ko: 배터리가 부족하면 중단
ru: Выключать при низком заряде
th: หยุดเมื่อแบตเตอรี่ต่ำ
zh_hans: 电量不足时停止

source: Stop when you lock your screen
ar: الإيقاف عند قفل الشاشة
de: Beim Sperren des Bildschirms beenden
ko: 화면을 잠그면 중단
ru: Выключать при блокировке экрана
th: หยุดเมื่อคุณล็อกหน้าจอ
zh_hans: 锁定屏幕时停止

source: Stop when your Mac overheats
ar: الإيقاف عند ارتفاع حرارة Mac
de: Bei Überhitzung beenden
ko: Mac이 과열되면 중단
ru: Выключать при перегреве
th: หยุดเมื่อ Mac ร้อนเกินไป
zh_hans: Mac 过热时停止

source: Stopped by Low Power Mode
ar: أُوقف بسبب وضع الطاقة المنخفضة
de: Vom Stromsparmodus beendet
ko: 저전력 모드로 인해 중단됨
ru: Выключено энергосбережением
th: หยุดเพราะโหมดพลังงานต่ำ
zh_hans: 因低电量模式已停止

source: Stopped to save battery
ar: أُوقف لتوفير البطارية
de: Beendet, um den Akku zu schonen
ko: 배터리 절약을 위해 중단됨
ru: Выключено, чтобы сберечь заряд
th: หยุดเพื่อประหยัดแบตเตอรี่
zh_hans: 为节省电量已停止

source: Stopped when the screen was locked
ar: أُوقف عند قفل الشاشة
de: Beim Sperren des Bildschirms beendet
ko: 화면이 잠겨 중단됨
ru: Выключено при блокировке экрана
th: หยุดเมื่อหน้าจอถูกล็อก
zh_hans: 屏幕锁定时已停止

source: Stopped when your Mac went to sleep
ar: أُوقف عندما دخل Mac في وضع السكون
de: Beendet, als dein Mac in den Ruhezustand ging
ko: Mac이 잠자기 상태가 되어 중단됨
ru: Выключено, когда Mac ушёл в сон
th: หยุดเมื่อ Mac เข้าสู่โหมดพัก
zh_hans: Mac 进入睡眠时已停止

source: Stopped, your Mac is too hot
ar: أُوقف، حرارة Mac مرتفعة جدًا
de: Beendet, dein Mac ist zu heiß
ko: Mac이 과열되어 중단됨
ru: Выключено: Mac перегрелся
th: หยุดแล้ว Mac ร้อนเกินไป
zh_hans: Mac 过热，已停止

source: Tells whether Macaffeine is keeping your Mac awake right now.
ar: يخبرك ما إذا كان Macaffeine يُبقي Mac مستيقظًا الآن.
de: Zeigt, ob Macaffeine deinen Mac gerade wach hält.
ko: Macaffeine이 지금 Mac 잠자기를 막고 있는지 알려줍니다.
ru: Сообщает, не даёт ли Macaffeine сейчас Mac уснуть.
th: บอกว่า Macaffeine กำลังกัน Mac ไม่ให้พักอยู่หรือไม่
zh_hans: 告诉你 Macaffeine 当前是否正在让 Mac 保持唤醒。

source: The screen won't dim or turn off while your Mac is kept awake.
ar: لن تخفت الشاشة أو تنطفئ أثناء إبقاء Mac مستيقظًا.
de: Der Bildschirm wird nicht abgedunkelt oder ausgeschaltet, solange dein Mac wach gehalten wird.
ko: 잠자기 방지 중에는 화면이 어두워지거나 꺼지지 않습니다.
ru: Экран не будет тускнеть и гаснуть, пока Mac не засыпает.
th: หน้าจอจะไม่หรี่หรือปิดขณะที่กัน Mac ไม่ให้พัก
zh_hans: 保持唤醒期间，屏幕不会变暗或关闭。

source: Timer finished at %@
ar: انتهى المؤقت عند %@
de: Timer um %@ abgelaufen
ko: %@에 타이머 종료
ru: Таймер закончился в %@
th: ตัวจับเวลาสิ้นสุดเมื่อ %@
zh_hans: 计时器已于 %@ 结束

source: Toggle Keep Awake
ar: تبديل الإبقاء مستيقظًا
de: Wach halten ein/aus
ko: 잠자기 방지 켜기/끄기
ru: Переключить «Не засыпать»
th: เปิด/ปิดกันพัก
zh_hans: 切换保持唤醒

source: Turn off Low Power Mode to keep awake.
ar: أوقف وضع الطاقة المنخفضة للمتابعة.
de: Schalte den Stromsparmodus aus, um weiterzumachen.
ko: 계속하려면 저전력 모드를 끄세요.
ru: Выключите энергосбережение, чтобы продолжить.
th: ปิดโหมดพลังงานต่ำเพื่อใช้งานต่อ
zh_hans: 关闭低电量模式以继续保持唤醒。

source: Turns Keep Awake on with the selected duration, or off.
ar: يشغّل الإبقاء مستيقظًا بالمدة المحددة أو يوقفه.
de: Schaltet Wach halten mit der gewählten Dauer ein oder aus.
ko: 선택한 시간으로 잠자기 방지를 켜거나 끕니다.
ru: Включает «Не засыпать» на выбранное время или выключает.
th: เปิดกันพักตามระยะเวลาที่เลือก หรือปิด
zh_hans: 按所选时长开启保持唤醒，或将其关闭。

source: Turns off Keep Awake, including requests from the command line.
ar: يوقف الإبقاء مستيقظًا، بما في ذلك طلبات سطر الأوامر.
de: Schaltet Wach halten aus, auch Anfragen aus der Befehlszeile.
ko: 명령어로 보낸 요청을 포함해 잠자기 방지를 끕니다.
ru: Выключает «Не засыпать», включая запросы из командной строки.
th: ปิดกันพัก รวมถึงคำขอจากบรรทัดคำสั่ง
zh_hans: 关闭保持唤醒，包括来自命令行的请求。

source: Type shortcut…
ar: اضغط الاختصار…
de: Kurzbefehl drücken …
ko: 단축키 입력…
ru: Нажмите сочетание…
th: กดคำสั่งลัด…
zh_hans: 键入快捷键…

source: Until %@…
ar: حتى %@…
de: Bis %@ …
ko: %@까지…
ru: До %@…
th: ถึง %@…
zh_hans: 至 %@…

source: Until you turn it off
ar: حتى تُوقفه
de: Bis du es ausschaltest
ko: 끌 때까지
ru: Пока вы не выключите
th: จนกว่าคุณจะปิด
zh_hans: 直到你将其关闭

source: Until…
ar: حتى…
de: Bis …
ko: 종료 시각 지정…
ru: До…
th: ถึงเวลา…
zh_hans: 直到…

source: Version %@
ar: الإصدار %@
ko: 버전 %@
ru: Версия %@
th: เวอร์ชัน %@
zh_hans: 版本 %@

source: When macOS reports a critical temperature, for example in a closed bag.
ar: عندما يُبلغ macOS عن حرارة حرجة، مثلًا داخل حقيبة مغلقة.
de: Wenn macOS eine kritische Temperatur meldet, zum Beispiel in einer geschlossenen Tasche.
ko: 닫힌 가방 안처럼 macOS가 위험 온도를 알릴 때 적용됩니다.
ru: Когда macOS сообщает о критической температуре, например в закрытой сумке.
th: เมื่อ macOS รายงานอุณหภูมิวิกฤต เช่น อยู่ในกระเป๋าที่ปิด
zh_hans: 当 macOS 报告温度过高时，例如放在合上的包里。

source: When the timer ends or a safety rule turns it off.
ar: عند انتهاء المؤقت أو إيقافه بقاعدة أمان.
de: Wenn der Timer abläuft oder eine Sicherheitsregel es ausschaltet.
ko: 타이머가 끝나거나 안전 규칙이 작동할 때 알립니다.
ru: Когда заканчивается таймер или срабатывает защита.
th: เมื่อตัวจับเวลาสิ้นสุดหรือกฎความปลอดภัยปิดการทำงาน
zh_hans: 计时器结束或安全规则将其关闭时。

source: When you put it to sleep or close the lid, Keep Awake is off after it wakes up.
ar: عندما تُدخل Mac في السكون أو تُغلق الغطاء، يكون الإبقاء مستيقظًا متوقفًا بعد الاستيقاظ.
de: Wenn du ihn in den Ruhezustand versetzt oder zuklappst, ist Wach halten nach dem Aufwachen aus.
ko: Mac을 잠자기 상태로 전환하거나 덮개를 닫으면 깨어난 후 잠자기 방지가 꺼집니다.
ru: Если вы усыпили Mac или закрыли крышку, после пробуждения режим будет выключен.
th: เมื่อคุณสั่งให้ Mac พักหรือปิดฝา กันพักจะปิดหลังจาก Mac ตื่น
zh_hans: 当你让 Mac 睡眠或合上屏幕后，唤醒时保持唤醒将处于关闭状态。

source: While %@ is running
ar: أثناء عمل %@
de: Solange %@ läuft
ko: %@ 실행 중
ru: Пока работает %@
th: ขณะที่ %@ ทำงาน
zh_hans: %@ 运行期间

source: Window
ar: نافذة
de: Fenster
ko: 윈도우
ru: Окно
th: หน้าต่าง
zh_hans: 窗口

source: You locked the screen, your Mac can sleep again.
ar: قفلت الشاشة، يمكن لـ Mac السكون مجددًا.
de: Du hast den Bildschirm gesperrt, dein Mac darf wieder in den Ruhezustand.
ko: 화면을 잠가서 Mac이 다시 잠자기할 수 있습니다.
ru: Экран заблокирован, Mac снова может засыпать.
th: คุณล็อกหน้าจอแล้ว Mac จึงพักได้อีกครั้ง
zh_hans: 你已锁定屏幕，Mac 可以重新进入睡眠。

source: Your Mac can sleep
ar: يمكن لـ Mac السكون
de: Dein Mac darf schlafen
ko: Mac이 잠자기할 수 있음
ru: Mac может уснуть
th: Mac พักได้
zh_hans: Mac 可以睡眠
